package com.example.kotlindemo

/**
 * @author TomCan
 * @description:
 * @date:2021/12/8 14:46
 */
class Constant {

    companion object {

        val TABS = ArrayList<String>()

        val FayeWong = "王菲（Faye Wong），1969年8月8日出生于北京，中国流行乐女歌手、影视演员 [1]  ，中国国家一级演员 [2]  [177]  。\n" +
                "1989年，推出首张个人专辑《王靖雯》，从而在香港乐坛正式出道 [4]  。1992年，凭借歌曲《容易受伤的女人》而被听众所熟知。1993年，在粤语专辑《十万个为什么？》 中尝试另类音乐的风格 [5]  。1994年，发行普通话专辑《天空》，并获得十大劲歌金曲颁奖典礼最受欢迎女歌星奖；同年在香港红磡体育馆举办18场“最精彩演唱会”，打破中国香港歌手初次开演唱会的场次纪录 [6]  。1996年，凭借专辑《浮躁》在国际上获得关注，并成为首位登上美国《时代周刊》封面的华人歌手 [39]  。1998年首登央视春晚，并演唱歌曲《相约一九九八》而在中国内地获得更多关注 [7]  ；同年，发行的专辑《唱游》亚洲销量累计超过250万张 [9]  [168]  ，并于次年获得新加坡SPVA唱片畅销排行榜年度销量冠军 [10]  。\n" +
                "1999年，凭借英文歌曲《Eyes on Me》获得第41届日本唱片大奖亚洲音乐奖 [11]  ，同年在日本武道馆举行个人演唱会 [12]  。2002年，以970万的唱片总销量载入吉尼斯世界纪录 [169]  ，被誉为最畅销粤语唱片女歌手 [165]  。2003年主演喜剧电影《天下无双》。2004年，凭借专辑《将爱》获得第15届台湾金曲奖最佳国语女演唱人奖 [13]  。2005年，在结束“菲比寻常巡回演唱会”后淡出乐坛 [14]  。2010年，复出乐坛并在央视春晚上演唱歌曲《传奇》，同年举办巡回演唱会 [15]  。2018年，与那英在春晚演唱《岁月》 [16]  。\n" +
                "演艺事业外，王菲热心公益慈善。2006年成立嫣然天使基金，以资助家庭贫困身患唇腭裂的患者等等\n" +
                "\n" +
                "王菲小时候与父母、哥哥一起居住在北京青年沟的煤矿大院 [19]  。1975年，王菲就读于北京地坛小学，并担任班上的文艺委员。\n" +
                "1980年，王菲就读于北京市东直门中学 [20]  。在读中学期间，她加入了中央电视台银河少儿艺术团。1983年，她在央视的六一晚会上独唱《大海啊故乡》《小百灵之歌》等歌曲。1984年，她在东直门中学读高中。高中二年级时，她出版了翻唱邓丽君歌曲的作品《风从那里来》、《邓丽君故乡情》等等 [21]  。\n" +
                "1987年，王菲放弃厦门大学生物系的录取资格并跟随父亲移居香港；同年，她经朋友介绍拜戴思聪为师，并在他的指导下学习声乐 [22]  。\n" +
                "演艺经历编辑 语音\n" +
                "新艺宝唱片\n" +
                "（1989~1996年）\n" +
                "1989年，王菲凭借粤语歌曲《仍是旧句子》获得亚太金铮流行曲创作大赛铜奖 [23]  ；同年，签约新艺宝唱片公司，并以艺名“王靖雯”推出了个人首张同名专辑《王靖雯》 [4]  ，从而在香港歌坛正式出道 [3]  ；该专辑发行后达到金唱片的销量 [24]  ，而王菲则凭借该专辑获得叱咤乐坛流行榜叱咤乐坛女歌手铜奖。1990年5月，发行专辑《Everything》 [25]  ，该专辑也奠定了王菲的歌路 [26]  ；8月，推出专辑《You're The Only One》，并逐渐形成个人化的音乐路线 [27]  。\n" +
                "王菲早期照片\n" +
                "王菲早期照片(3张)\n" +
                "1991年，发行精选专辑《Shirley Once More》；同年，赴美国修读音乐方面的课程 [28]  ；此外，她还为无线拍摄了电视电影《别姬》，在片中饰演思想单纯的的歌女阿芳 [29]  。1992年，从美国返回香港；7月，发行融合中西方音乐风格的粤语专辑《Coming Home》，并通过该专辑开始形成拖音唱腔 [26]  ；专辑中的歌曲《容易受伤的女人》在推出后获得关注，并获得十大劲歌金曲颁奖礼十大金曲奖、十大中文金曲颁奖礼十大金曲奖、叱咤乐坛流行榜至尊歌曲等奖项。\n" +
                "1993年2月5日，王菲发行了粤语专辑《执迷不悔》，她在专辑中转变音乐风格，并首次加入摇滚乐 [30]  ；专辑主打歌《执迷不悔》是她首次尝试歌词创作的作品，并获得大中文金曲奖、十大劲歌金曲奖等奖项；3月1日，参演的时装科幻剧《原振侠》播出，并演唱该剧的插曲《软弱》；4月，主演时装律政剧《壹号皇庭II》，在剧中饰演办事能干的检察官唐毓文；9月，在返回香港后发行了粤语专辑《十万个为什么？》，她在专辑中将独立流行乐和个人声线合而为一，尝试另类音乐的风格 [5]  ；在这张专辑中，王菲参与了包括词曲创作、造型设计、封面概念设计在内的幕后工作，而其中的歌曲《动心》是王菲第一次包揽作词和作曲的作品 [31]  ；12月，发行个人首张EP《如风》；同年，获得十大劲歌金曲国内最受欢迎香港女歌星奖、叱咤乐坛流行榜叱咤乐坛女歌手金奖等奖项。\n" +
                "王靖雯时期\n" +
                "王靖雯时期(7张)\n" +
                "1994年4月，发行个人首张普通话专辑《迷》，主打歌《我愿意》获得第1届华语音乐榜中榜ChannelV中文Top20榜中榜歌曲奖 [32]  ；5月，发行EP《菲碟》 [171]  ；6月，不再使用艺名“王靖雯”，而以本名“王菲”推出粤语专辑《胡思乱想》，她在专辑中翻唱了多首英伦另类音乐风格的歌曲，其中《梦中人》是她首度运用咽音技巧的作品 [33]  ；7月14日，与王家卫导演合作的文艺片《重庆森林》上映，王菲在片中饰演具有独立想法的速食店打工女孩阿菲；11月，发行普通话专辑《天空》，其中《天使》是其首度尝试长线卷音吟唱的作品 [34]  ，而主打歌《棋子》则获得第3届新加坡金曲奖最佳金曲奖；该专辑发行第二周便获得台湾金曲龙虎榜国语销量榜冠军，并在金曲龙虎榜销售榜前10名的位置停留23周，专辑在台湾的年度销量近80万张，在台湾的累计销售点数为78660点，在亚洲的累计销量突破300万张 [35]  ；至此，王菲凭借《胡思乱想》、《天空》两张专辑形成个人风格，并获得十大劲歌金曲最受欢迎女歌手、十大劲歌金曲亚太区最受欢迎女歌手、叱咤乐坛女歌手金奖、十大中文金曲全球华人最受欢迎女歌手、新城劲爆女歌手奖 [151]  ；11月起，在温哥华、多伦多、亚特兰大等地举行演唱会 [36]  ；12月，发行粤语专辑《讨好自己》，并为专辑创作了主打歌《讨好自己》以及RAP说唱曲《出路》；该专辑整体凸显英伦风格，在香港IFPI唱片销量榜前十名的位置停留10周，在香港地区的累计销量突破三白金；12月22日起，在香港红磡体育馆一连举办18场演唱会，打破中国香港歌手初次开演唱会的场次纪录 [6]  。\n" +
                "王菲\n" +
                "王菲(3张)\n" +
                "1995年，凭借文艺片《重庆森林》获得第14届香港电影金像奖最佳女主角提名 [37]  ；5月，发行EP《一人分饰两角》；7月，发行向邓丽君致敬的翻唱专辑《菲靡靡之音》；12月，推出英伦迷幻风格的粤语专辑《Di-Dar》，并为专辑创作了《Di-Dar》和《假期》两首歌曲 [38]  ；专辑发行第二周获得香港IFPI唱片销量榜冠军，并在榜单前十名的位置停留10周，在香港的累计销量突破三白金，专辑主打歌曲《暧昧》获得第19届十大中文金曲颁奖礼最佳改编歌曲奖；同年，获得第3届新加坡金曲奖最受欢迎女歌手奖、十大劲歌金曲颁奖礼亚太地区最受欢迎女歌手等奖项。\n" +
                "1996年5月，发行以个人自主状态作为主导概念的专辑《浮躁》；该专辑不同于主流流行音乐的风格，王菲将Brit Pop及部分Dream Pop元素加入到专辑中 [33]  ，并为专辑创作了《无常》、《堕落》等8首歌曲 [38]  ；王菲也凭借该专辑在国际上获得关注，并成为美国《时代周刊》的封面人物 [39]  ；同年，获得第7届台湾金曲奖最佳国语女演唱人提名、十大劲歌金曲颁奖礼亚太区最受欢迎女歌手等奖项。\n" +
                "百代唱片\n" +
                "（1997~2001年）\n" +
                "1997年2月，发行粤语EP《玩具》；同年，以6000万港币的签约费与百代唱片签约，并宣布不再出粤语专辑；9月，推出普通话专辑《王菲》，并融合英式摇滚等曲风；该专辑发行后在台湾的销量超过50万张 [40]  ，其中主打歌《你快乐所以我快乐》获得十大中文金曲颁奖礼全球华语金曲奖、全球华语音乐榜中榜ChannelV中文Top20榜中榜歌曲奖 [41]  ；10月，发行粤语EP《自便》；同年，推岀精选集《菲卖品》 [40]  。\n" +
                "王菲\n" +
                "王菲(2张)\n" +
                "1998年春节，王菲与那英在央视春晚上合唱歌曲《相约1998》，并获得第1届CCTV-MTV音乐盛典内地最受欢迎流行歌曲奖 [42]  ；9月，推出专辑《唱游》，并首度尝试晒伤妆造型 [8]  ；除了担任专辑监制并创作《感情生活》、《脸》等4首歌曲外 [38]  ，她还在专辑中运用美声、颤音、拖音、假声、气声等演唱技巧 [8]  ；专辑发行后在亚洲的累积销量超过250万张 [35]  ，并蝉联马来西亚RIM中文唱片销售榜7周冠军；而在新加坡，该专辑在SPVA销量榜前十名的位置停留6个月的时间，并于次年获得新加坡SPVA唱片畅销排行榜年度销量冠军 [10]  ；10月起，在广州、深圳、昆明等地举行“唱游大世界演唱会” [43]  。\n" +
                "王菲\n" +
                "王菲(5张)\n" +
                "1999年2月，演唱电玩主题曲《Eyes on Me》 [44]  ，该曲在日本发行后位列日本Oricon销量榜第9位，使得王菲成为首位凭借非日文歌曲而进入Oricon榜单前10位的华人歌手 [45]  ；该曲的同名专辑在日本的销量超过35万，成为日本外语唱片的销量冠军 [45]  ，并获得第41届日本唱片大奖亚洲音乐奖 [46]  ；3月，在日本武道馆举行个人演唱会 [12]  ；8月21日，在吉隆坡武吉加利尔室内体育馆举行个人演唱会 [47]  ；9月，发行普通话专辑《只爱陌生人》，除了为专辑创作歌曲《精彩》外，她还首度尝试演唱拉丁曲风的歌曲 [48]  ；该专辑年度销量超过80万张 [49]  ，并于次年获得新加坡SPVA唱片畅销排行榜年度销量冠军以及第7届新加坡金曲奖年度最畅销专辑奖；同年，获得十大中文金曲颁奖礼全球华人最受欢迎女歌手、十大劲歌金曲颁奖礼亚太区最受欢迎女歌手等奖项。\n" +
                "2000年，凭借专辑《只爱陌生人》获得第11届台湾金曲奖最佳国语女演唱人奖提名；7月，主演爱情片《恋战冲绳》，在片中饰演个性格率直的酒吧女老板Doris [50]  ；10月，发行普通话专辑《寓言》，并为专辑创作了电子风格的《新房客》、Trip-Hop风格的《彼岸花》等5首歌曲 [38]  ，该专辑的风格回归主流音乐 [51]  ，并获得中华音乐人交流协会年度十大专辑奖、第1届全球华语歌曲排行榜最佳专辑等奖项；同年，在台北、南京、长沙、墨尔本、悉尼等地举行世界巡回演唱会 [12]  [52]  。\n" +
                "王菲\n" +
                "王菲\n" +
                "2001年3月，获得第12届台湾金曲奖最佳国语女演唱人奖提名 [53]  ；4月，主演日本励志喜剧《弄假成真》，在剧中饰演积极朝目标迈进的留日学生林菲 [54]  ；9月7日至8日，在广州体育馆举行演唱会，并演唱了《我愿意》、《人间》等代表作 [55]  ；9月22日，在上海虹口体育场举行演唱会；10月，推出普通话专辑《王菲2001》 [56]  ，专辑中的歌曲《光之翼》在日本Oricon榜单排名第19位 [45]  ，而专辑主打歌《流年》则获得第2届华语音乐年度大奖十大华语歌曲奖、第13届台湾金曲奖最佳录影带奖 [57]  ；7月25日，发行单曲《Separate Ways》 [58]  ，该曲是日剧《弄假成真》的主题曲，发行后在日本Oricon榜单排名第14位 [45]  ；11月1日至2日，在东京武道馆举办两场“全面体演唱会” [12]  。\n" +
                "新力唱片\n" +
                "舞台上的王菲\n" +
                "舞台上的王菲(20张)\n" +
                "2002年，王菲与新力唱片公司签下合约；3月，发行精选专辑《你王菲所以我王菲》；5月，以970万的唱片总销量（统计时间截至到2000年3月）获得吉尼斯世界纪录大全颁发的“唱片销量最高的粤语女歌手”证书；同年，与梁朝伟、赵薇共同主演喜剧片《天下无双》，在片中饰演女扮男装的无双公主，并凭借该片获得第22届香港电影金像奖最佳女主角奖提名以及第9届香港电影评论学会最佳女演员奖 [59]  。\n" +
                "2003年11月7日，推出普通话专辑《将爱》，除了担任唱片监制外，她还为专辑创作了摇滚风格的《将爱》、Trip-Hop风格的《不留》等四首歌曲 [60]  ；该专辑融合了抒情、电子乐、Trip- Hop等曲风，并获得IFPI唱片销量大奖十大销量国语唱片、华语音乐传媒大奖年度十大唱片奖等奖项 [61]  ；12月20日至12月27日，在香港红磡体育馆连开8场“菲比寻常演唱会”，并演唱了《执迷不悔》、《红豆》等代表作 [62]  ；同年，获得第4届中国金唱片奖港台女艺人奖、第5届CCTV-MTV音乐盛典亚洲地区最佳女歌手奖 [63]  。\n" +
                "2004年4月，凭借歌曲《不留》入围第15届台湾金曲奖最佳作词人奖 [64]  ；5月，凭借专辑《将爱》获得第15届台湾金曲奖最佳国语女演唱人 [13]  ；9月28日，王菲与梁朝伟、巩俐、木村拓哉共同主演的剧情片《2046》上映，她在片中饰演个性犹豫不定的王靖雯；同年，在吉隆坡、新加坡、杭州等地举行“菲比寻常演唱会” [65]  。\n" +
                "淡出歌坛\n" +
                "2005年3月，位列福布斯中国名人榜第5位 [66]  ；5月底，王菲淡出歌坛 [67]  ；同年凭借文艺片《2046》获得第5届华语电影传媒大奖最佳女演员奖提名 [68]  。\n" +
                "2008年，王菲演唱的歌曲《天空》入选《南方周末》评出的“改革开放三十年之十大歌曲” [69]  。2009年12月，发行EP《爱笑的天使》，主打歌《心经》是剧情片《唐山大地震》的片尾曲 [70]  。\n" +
                "复出歌坛\n" +
                "王菲\n" +
                "王菲(3张)\n" +
                "2010年1月，王菲正式复出歌坛，并为电影《孔子》演唱了主题曲《幽兰操》 [161]  ；2月13日，登上2010年中央电视台春节联欢晚会并演唱了歌曲《传奇》 [71]  ；同年10月起，先后在北京、上海各举行了5场“王菲巡回演唱会”，演唱会开票10天内的预售成绩达1888万元，打破中国内地演唱会门票的预售纪录 [72-73]  。\n" +
                "2011年1月，与陈奕迅共同演唱爱情片《将爱情进行到底》的主题曲《因为爱情》 [74]  ，并获得第4届华语金曲奖年度最佳国语歌曲奖、第8届中国金唱片奖数字音乐金曲奖等奖项 [75]  ；3月，在香港亚洲国际博览馆举行5场个人演唱会，并演唱了《约定》、《给自己的情书》等代表作；同年，在武汉、哈尔滨、成都等地举行巡回演唱会 [76]  。\n" +
                "杂志封面\n" +
                "杂志封面(8张)\n" +
                "2012年1月，发行单曲《愿》；2月，在重庆奥体中心举行个人演唱会，演唱会以“重生与四季”为主题，展现了王菲的音乐之路 [77]  ；同年，获得第8届中国金唱片奖数字音乐类歌手奖。\n" +
                "2013年5月19日，王菲在“邓丽君60周年演唱会”上以歌声向偶像追思，她与邓丽君隔空对唱了其生前未公开的歌曲《清平调》 [157]  ；7月26日，为电影《致我们终将逝去的青春》演唱的主题曲《致青春》发布 [78]  ，该曲获得第9届中国金唱片奖金曲奖 [79]  ；同年，王菲开始处于半退隐状态 [80]  。\n" +
                "2014年11月8日，王菲演唱的电影同名主题曲《匆匆那年》发布，发行首日播放量达到627万，创下电影宣传视频的单日播放量纪录 [81]  ，MV推出5天后播放量超过2000万 [82]  ；同年，为电影《触不可及》演唱主题曲《爱不可及》 [83]  。\n" +
                "2015年2月，在英国市场研究公司YouGov公布的调查中，王菲位列“全球最受仰慕的女性第17名” [84]  ；5月，在第5届全球流行音乐金榜颁奖礼中，凭借歌曲《匆匆那年》获得年度最佳电影歌曲奖、年度二十大金曲奖；9月，为电影《港囧》演唱主题曲《清风徐来》 [85]  ；11月，发行粤语专辑《敷衍》，这是王菲第十张粤语专辑 [86]  。\n" +
                "2016年7月22日，发行个人填词的单曲《尘埃》 [87]  ；同年，为电影《从你的全世界路过》演唱片尾曲《你在终点等我》 [159]  ；12月30日，在上海举办单场幻乐一场演唱会 [88]  ，该演唱会同步全球166个国家，通过360全景网络+VR全景进行全程直播，直播期间总观看人数超过2000万，累计总播放量达3.5亿，且“收割”了56万条弹幕 [89-90]  。2017年11月3日，王菲与马云共同为电影《功守道》演唱的主题曲《风清扬》发布 [162]  。\n" +
                "2018年1月9日，王菲演唱的电影同名推广曲《无问西东》发行 [91]  ；2月15日，登上2018年中央电视台春节联欢晚会，并与那英合唱歌曲《岁月》 [16]  ；7月20日，在国内首档音乐创演秀节目《幻乐之城》中担任“幻乐体验官” [149]  ；12月9日，王菲加盟并担任“国宝守护人”的央视文博探索节目《国家宝藏第二季》播出，她在首期节目中以民国《大公报》记者的视角，讲述了民国时期“清样式雷建筑烫样”的故事 [156]  ；同年，王菲还为电影《邪不压正》演唱了推广曲《偶遇》 [160]  。\n" +
                "2019年，为电影演唱了同名主题曲《我和我的祖国》 [92]  。2020年1月19日，为电影《夺冠》演唱片尾曲《生命之河》 [93]  ；9月9日，王菲在全明星晚会“99划算盛典”中翻唱了《Landing Guy》、《下雨天》、《私人公园》等多首歌曲，还与马云隔空合唱《如果云知道》 [164]  。\n" +
                "2021年9月21日，王菲于《“湾区升明月”2021大湾区中秋电影音乐晚会》上献唱了湾区升明月主题曲《湾》 [166]  ；9月25日，其为电影《我和我的父辈》演唱的主题推广曲《如愿》发行 [167]  。\n" +
                "个人生活编辑 语音\n" +
                "家庭情况\n" +
                "王菲的祖父王墨林（亦称王兆民）毕业于北京大学国文系，20世纪40年代担任过立法委员。王菲的父亲王佑林是位煤炭工程师，母亲夏桂影是煤矿文工团的女高音 [94-95]  。王菲15岁之前一直随母亲姓，取名“夏林”，15岁后才改名为“王菲” [96]  。\n" +
                "感情生活\n" +
                "1996年7月，王菲和窦唯结婚 [97]  。1997年1月3日，王菲生下女儿窦靖童 [98]  。1999年8月，王菲与窦唯正式离婚 [97]  ，女儿窦靖童跟了王菲，窦靖童曾透露她们家庭关系是平等、尊重的 [99-100]  。\n" +
                "2000年6月，王菲与谢霆锋的恋情公开 [101]  。2002年3月28日，两人分手。2003年6月，王菲与谢霆锋复合；11月，王菲与谢霆锋再度分手 [101]  。2014年9月，王菲与谢霆锋复合 [102-103]  。\n" +
                "2004年7月，王菲和李亚鹏的恋情正式公开 [17]  。2005年7月29日，两人结婚 [104]  。2006年5月27日，王菲产下女儿李嫣，但其患有先天性唇腭裂 [105-106]  。2013年9月13日，王菲与李亚鹏在乌鲁木齐离婚，女儿李嫣抚养权归李亚鹏所有 [17]  [106]  。\n" +
                "个人信仰\n" +
                "王菲与女儿窦靖童、李嫣\n" +
                "王菲与女儿窦靖童、李嫣(5张)\n" +
                "王菲笃信佛教，不仅多次参加印度菩提迦耶法会，而且坚持吃素 [107-109]  。2001年，王菲推出佛教专辑《悲智双运》，为师父梭巴仁波切的一项建造全球最大弥勒佛造像的计划筹款。这是王菲首次唱经文。为了支持师父，王菲还捐出900万港币给尼泊尔的雪山之颠高屋建瓴和“全球最大弥勒佛造像”工程 [110]  。2009年5月8日，参加陕西法门寺合十舍利塔落成暨佛指舍利安奉大典 [111]  。"


    }
}